sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
/****************************************************************************//*!
*
* @file  	slider.c
*
* @version  1.0.0.0
*
* @date     December-2017
*
* @brief    Slider electrode touch sense routines for S32K144
*
*******************************************************************************/

/*******************************************************************************
 * Includes
 *******************************************************************************/
#include <TS/Cfg/ts_cfg.h>
#include <TS/ets.h>
#include <TS/filter.h>
#include <TS/main.h>
#include <TS/Peripherals/adc.h>
#include <TS/Peripherals/adc_inline_fcn1.h>
#include <TS/Peripherals/gpio.h>
#include <TS/Peripherals/gpio_inline_fcn1.h>
#include <TS/Peripherals/tcd.h>
#include <TS/Peripherals/timer.h>
#include <TS/slider.h>
#include "S32K144.h"
#include "tcd.h"
#if SLIDER_ENABLE
/*******************************************************************************
 * Variables
 ******************************************************************************/
// Slider Electrodes status
tElecStatus   sliderElectrodesStatus;
// Slider Electrode structure
tElecStruct  sliderElecStruct[NUMBER_OF_SLIDER_ELECTRODES];
extern tElecStruct  elecStruct[NUMBER_OF_ELECTRODES];
// Guard pin structure
extern tGuardStruct guardStruct[1];

// Slider electrode capacitance to equivalent voltage conversion
int16_t   numberOfElectrodeSensingCyclesPerSampleSlider, sliderDroppedSamples;
int32_t   sliderAdcDataElectrodeDischargeRaw[NUMBER_OF_SLIDER_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
int16_t   sliderAdcDataElectrodeDischargeRawSample[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE];
int16_t   sliderAdcDataElectrodeDischargeRawSampleElec0[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE];
int16_t   sliderAdcDataElectrodeDischargeRawSampleElec1[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE];
uint32_t   sliderAdcDataElectrodeDischargeRawCalc;

// Extern variables for slider electrode capacitance to equivalent voltage conversion
extern uint8_t elecNum;
extern uint16_t sampleNum;
extern uint16_t  chargeDistributionPeriod, chargeDistributionPeriodTmp;

// Wake up
extern uint16_t  electrodeWakeUpActivateCounter;
uint16_t  sliderVirtualEGSActivateCounter;
uint8_t   sliderElecNumAct;

// Slider Electrode DC tracker self-trim after power-up or reset
int32_t   sliderAdcDataElectrodeDischargeBuffer[NUMBER_OF_SLIDER_ELECTRODES];
uint16_t  sliderAdcDataElectrodeDischargeBufferCounter[NUMBER_OF_SLIDER_ELECTRODES];

// DC Tracker
int32_t   sliderDCTrackerDataBufferRaw[NUMBER_OF_SLIDER_ELECTRODES];
int32_t   sliderDCTrackerDataBuffer[NUMBER_OF_SLIDER_ELECTRODES];
uint8_t   sliderDCTrackerDataShift[NUMBER_OF_SLIDER_ELECTRODES];

// LP Filter
tFrac32   sliderLPFilterData[NUMBER_OF_SLIDER_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern uint8_t   LPFilterType[NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES];
extern tFrac32   LPFilterData[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];// For sampling change EGS

// Detector
int32_t   sliderDetectorThresholdTouch[NUMBER_OF_SLIDER_ELECTRODES];
int16_t   sliderDetectorThresholdTouchDelta[NUMBER_OF_SLIDER_ELECTRODES];
uint8_t   sliderElectrodeTouch[NUMBER_OF_SLIDER_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern 	uint8_t   electrodeTouch[NUMBER_OF_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];
extern int32_t   detectorThresholdTouch[NUMBER_OF_ELECTRODES];// For sampling change EGS
uint8_t   sliderVirtualEGSTouch;

// Slider Touch qualification
uint8_t   sliderElectrodeTouchQualified;
uint8_t	  sliderElectrodeTouchQualifiedReport;
tBool hitHysteresis;
tBool positionDeciced;
tBool firstSliderTouch;
int8_t  positionCounter;
uint8_t thresholdNum;

// Slider data
int16_t sliderDifferenceData, sliderDifferenceDataFiltered;
int16_t sliderAdditionData;
int16_t sliderAdditionDataThreshold;
int16_t sliderAbsoluteRawData, sliderAbsoluteRawDataFiltered;

// Slider helper differential data thresholds for Freemaster
int16_t sliderDiffThreshold[NUMBER_OF_THRESHOLDS_FREEMASTER + NUMBER_OF_SLIDER_THRESHOLDS] = {0};// PreInit to zero because of Freemaster
int16_t *sliderLastDiffThreshold;

// Slider defines variables
int8_t numberOfHysteresisBlindPoints;

// Low power mode
extern uint8_t  lowPowerModeCtrl;

// FrequencyHopping
extern uint8_t   frequencyID,frequencyIDsave;
extern uint8_t   frequencyHoppingActivation;

// Decimation filter
int32_t   sliderAdcDataElectrodeDischargeRawDF[NUMBER_OF_SLIDER_ELECTRODES][NUMBER_OF_HOPPING_FREQUENCIES];

// Oversampling
uint8_t sliderOversamplingActivationReport;

// DMA control flags
extern volatile uint32_t ready_dma_flag, start_dma_flag;

/*****************************************************************************
 *
 * Function: void SliderElectrodeStructureInit(void)
 *
 * Description: Slider electrodes structure init
 *
 *****************************************************************************/
void SliderElectrodeStructureInit(void)
{
#ifdef SLIDER_ELEC0
	// Load slider electrode 0 hardware data
	sliderElecStruct[0].adcBasePtr = SLIDER_ELEC0_ADC;
	sliderElecStruct[0].adcChNum = SLIDER_ELEC0_ADC_CHANNEL;
	sliderElecStruct[0].portBasePtr = SLIDER_ELEC0_PORT;
	sliderElecStruct[0].gpioBasePtr = SLIDER_ELEC0_GPIO;
	sliderElecStruct[0].pinNumberElec = SLIDER_ELEC0_ELEC_GPIO_PIN;
	sliderElecStruct[0].pinNumberCext = SLIDER_ELEC0_CEXT_GPIO_PIN;
	sliderElecStruct[0].portMask = SLIDER_ELEC0_PORT_MASK;
	sliderElecStruct[0].ELEC_DMAMUX = SLIDER_ELEC0_DMAMUX;
	sliderElecStruct[0].ELEC_TRGMUX = SLIDER_ELEC0_TRGMUX;
	// Load electrode 0 application data
	sliderDCTrackerDataShift[0] = SLIDER_ELEC0_DCTRACKER_FILTER_FACTOR;
	LPFilterType[NUMBER_OF_ELECTRODES + 0] = SLIDER_ELEC0_LPFILTER_TYPE;
	sliderDetectorThresholdTouchDelta[0] = SLIDER_ELEC0_TOUCH_THRESHOLD_DELTA;
#endif

