sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
#ifdef SLIDER_ELEC1
	// Load slider electrode 1 hardware data
	sliderElecStruct[1].adcBasePtr = SLIDER_ELEC1_ADC;
	sliderElecStruct[1].adcChNum = SLIDER_ELEC1_ADC_CHANNEL;
	sliderElecStruct[1].portBasePtr = SLIDER_ELEC1_PORT;
	sliderElecStruct[1].gpioBasePtr = SLIDER_ELEC1_GPIO;
	sliderElecStruct[1].pinNumberElec = SLIDER_ELEC1_ELEC_GPIO_PIN;
	sliderElecStruct[1].pinNumberCext = SLIDER_ELEC1_CEXT_GPIO_PIN;
	sliderElecStruct[1].portMask = SLIDER_ELEC1_PORT_MASK;
	sliderElecStruct[1].ELEC_DMAMUX = SLIDER_ELEC1_DMAMUX;
	sliderElecStruct[1].ELEC_TRGMUX = SLIDER_ELEC1_TRGMUX;
	// Load slider electrode 1 application data
	sliderDCTrackerDataShift[1] = SLIDER_ELEC1_DCTRACKER_FILTER_FACTOR;
	LPFilterType[NUMBER_OF_ELECTRODES + 1] = SLIDER_ELEC1_LPFILTER_TYPE;
	sliderDetectorThresholdTouchDelta[1] = SLIDER_ELEC1_TOUCH_THRESHOLD_DELTA;
#endif

	// If EGS is OFF and TS method is oversampling
	#if !defined(WAKE_UP_ELECTRODE) && TS_RAW_DATA_CALCULATION == OVERSAMPLING
	// All slider electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
	}
	#endif

	#ifdef WAKE_UP_ELECTRODE
	#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING) || (DECIMATION_FILTER) || (FREQUENCY_HOPPING)
	// All slider electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
	}
	#endif
	#endif
}

/*****************************************************************************
*
* Function: void SliderElectrodeADCchannelOffset(void)
*
* Description: Fixes ADC channel number in case it is higher than 15
*
*****************************************************************************/
void SliderElectrodeADCchannelOffset(void)
{
	// All slider electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// ADC channel number higher than 15?
		if(sliderElecStruct[elecNum].adcChNum > 15)
		{
			// Add offset
			sliderElecStruct[elecNum].adcChNum += ELECTRODE_ADC_CHANNEL_OFFSET;
		}
	}

}

/*****************************************************************************
 *
 * Function: void SliderElectrodeTouchSenseInit(void)
 *
 * Description: Init touch sense variables for slider electrodes
 *
 *****************************************************************************/
void SliderElectrodeTouchSenseInit(void)
{

	// Slider electrodes structure init
	SliderElectrodeStructureInit();

	// Cext pin ADC channel number correction (in case higher ADC channel number used)
	SliderElectrodeADCchannelOffset();

	// Reset slider electrodes status
	sliderElectrodesStatus.byte = 0;

	// Reset slider First touch indicator
	firstSliderTouch = TRUE;

	// Slider Default Variables
	// Get helper thresholds to see the thresholds in Freemaster
	SliderDifferenceDataHelperThresholds();

	// Get default number of hysteresis blind points
	numberOfHysteresisBlindPoints = NUMBER_OF_HYSTERESIS_BLIND_POINTS;

	// Set the default idle number of sensing cycles for slider electrodes
	numberOfElectrodeSensingCyclesPerSampleSlider = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE;

	// Reset the number of dropped samples
	sliderDroppedSamples = 0;

	// Reset - report that all slider electrodes proximity released
	sliderVirtualEGSTouch = 0;

	// Set the default slider addition data threshold of y-direction false touch canceling
	sliderAdditionDataThreshold = SLIDER_ADDITION_DATA_THRESHOLD_DEFAULT;

	// Set slider difference and addition data to theirs baseline
	sliderDifferenceData = SLIDER_DIFFADD_DATA_OFFSET;
	sliderAdditionData = SLIDER_DIFFADD_DATA_OFFSET;

}
/*****************************************************************************
 *
 * Function: void SliderDifferenceDataHelperThresholds (void)
 *
 * Description: Slider helper differential data thresholds for Freemaster
 *
 *****************************************************************************/
void SliderDifferenceDataHelperThresholds (void)
{
	// Automatic difference thresholds generation/loading, theoretically unlimited number of thresholds
	#if  AUTO_DIFF_THRESHOLDS_GEN

	uint8_t segmentNum;

		for(segmentNum = 0; segmentNum < NUMBER_OF_SLIDER_THRESHOLDS; segmentNum++)
		{
			sliderDiffThreshold[segmentNum] = (NUMBER_OF_MINIMAL_OBSERVED_DIFFERENCE + (SLIDER_STEP*(segmentNum + 1)));
		}

	#else // Manual difference thresholds loading, maximum 7 thresholds -> 8 segments
	#ifdef SLIDER_DIFF_THRESHOLD0
		sliderDiffThreshold[0] = SLIDER_DIFF_THRESHOLD0;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD1
		sliderDiffThreshold[1] = SLIDER_DIFF_THRESHOLD1;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD2
		sliderDiffThreshold[2] = SLIDER_DIFF_THRESHOLD2;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD3
		sliderDiffThreshold[3] = SLIDER_DIFF_THRESHOLD3;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD4
		sliderDiffThreshold[4] = SLIDER_DIFF_THRESHOLD4;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD5
		sliderDiffThreshold[5] = SLIDER_DIFF_THRESHOLD5;
	#endif

	#ifdef SLIDER_DIFF_THRESHOLD6
		sliderDiffThreshold[6] = SLIDER_DIFF_THRESHOLD6;
	#endif

	#endif
		// Varying last difference threshold pointer assignment
		sliderLastDiffThreshold = &sliderDiffThreshold[NUMBER_OF_SLIDER_THRESHOLDS-1];
}

/*****************************************************************************
 *
 * Function: void electrodeSelfTrim(void)
 *
 * Description: Run slider electrodes self-trim algorithm
 *
 *****************************************************************************/
void SliderElectrodeSelfTrim(void)
{
	// Device after power-up / reset ?
	if (sliderAdcDataElectrodeDischargeBufferCounter[0] < NUMBER_OF_CYCLES_DCTRACKER_PWRUP)
	{
		// All Slider electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
		{
			// Store Slider electrode init value
			ElectodeBufferInitVal(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderAdcDataElectrodeDischargeBuffer[elecNum]), &(sliderAdcDataElectrodeDischargeBufferCounter[elecNum]));
		}
	}
	// Calculate and load init value
	else
	{
		// All Slider electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
		{
			// Calculate Slider electrode init value
			ElectodeCalInitVal(&(sliderAdcDataElectrodeDischargeBuffer[elecNum]), &(sliderAdcDataElectrodeDischargeBufferCounter[elecNum]));
		}

