sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		// Set slider electrode status "self-trim done" flag
		sliderElectrodesStatus.bit.selfTrimDone = YES;
	}
}
/*****************************************************************************
 *
 * Function: void SliderElectrodeSelfTrimSense(void)
 *
 * Description: Slider electrodes self-trim after power-up or reset
 *
 *****************************************************************************/
void SliderElectrodeSelfTrimSense(void)
{
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif

	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
	    ElectrodeFloat(&elecStruct[elecNum]);
	}

#if (NUMBER_OF_USED_ADC_MODULES == 2)
	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)

		// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once by DMA
		SliderSimultaneousElectrodeCapToVoltConvELCH_DMA(SLIDER_ELEC0, SLIDER_ELEC1);

	#else
		// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once BY CPU
		SliderSimultaneousElectrodeCapToVoltConvELCH(SLIDER_ELEC0, SLIDER_ELEC1);
	#endif

#else
	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		// Convert Slider electrode capacitance to equivalent voltage one by one by DMA (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCH_DMA(elecNum);
	}
	#else
		// Convert Slider electrode capacitance to equivalent voltage one by one by CPU (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCHGuard(SLIDER_ELEC0, SLIDER_ELEC1);
	#endif

#endif
	// Drive all slider electrodes to GND
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}

	// Drive all touch button (and EGS) electrodes to GND
 	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
 	{
 		ElectrodeGnd(&elecStruct[elecNum]);
 	}

	// Slider electrodes self trim
	SliderElectrodeSelfTrim();

	// Slider Electrodes self-trim done?
	if(sliderElectrodesStatus.bit.selfTrimDone == YES)
	{
		// All slider electrodes
		for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
		{
			// DC tracker data
			sliderDCTrackerDataBuffer[elecNum] = sliderAdcDataElectrodeDischargeBuffer[elecNum];
			// Load DC tracker buffer
			sliderDCTrackerDataBufferRaw[elecNum] = (sliderDCTrackerDataBuffer[elecNum]) << ((sliderDCTrackerDataShift[elecNum]));
			// Slider Electrode touch and release thresholds
			sliderDetectorThresholdTouch[elecNum] = sliderDCTrackerDataBuffer[elecNum] - sliderDetectorThresholdTouchDelta[elecNum];
		}

		// All (both) used scanning frequencies
        for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
        {
        	// All slider electrodes
        	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
        	{
    			// Slider electrodes LP IIR filter buffer init (FM only)
    			sliderLPFilterData[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum];
        		// Slider Raw data preset as baseline
        		sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum];

			#if DECIMATION_FILTER
				// Pre-load DF array
				sliderAdcDataElectrodeDischargeRawDF[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum];
			#endif
        	}
        }
        // Reset frequencyID
        frequencyID = 0;

        // All (both) used scanning frequencies
        for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
        {
    		// All Slider electrodes
    		for (elecNum = NUMBER_OF_ELECTRODES; elecNum < (NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
    		{
    			// Init IIR filter
    			FilterIIR1BufferInit(elecNum, ((tFrac32)(sliderDCTrackerDataBuffer[(elecNum) - NUMBER_OF_ELECTRODES])), ((tFrac32)(sliderDCTrackerDataBuffer[(elecNum) - NUMBER_OF_ELECTRODES])), frequencyID);
    		}
        }
        // Reset frequencyID
        frequencyID = 0;

#if (WAKE_UP_ELECTRODE_PROXIMITY == WAKE_UP_ELECTRODE_PROXIMITY_YES)
		// Enable LPTMR
		LPTMR0_Init(LPTMR_ELEC_SENSE_PROXIMITY);
#else
	#if (DECIMATION_FILTER && OPTIONAL_WAKE_UP_ELECTRODE == WAKE_ELEC_NO)
			// Enable LPTMR
			LPTMR0_Init(LPTMR_ELEC_SENSE_DF);
	#else
			// Enable LPTMR
			LPTMR0_Init(LPTMR_ELEC_SENSE);
	#endif
#endif

		// Enable low power mode
		lowPowerModeCtrl = ON;
	}

#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif
}

/*****************************************************************************
 *
 * Function: void SliderDCTrackerShiftIncrease(void)
 *
 * Description: DCtrackershift increase
 *
 *****************************************************************************/
void SliderDCTrackerShiftIncrease(void)
{
		// All slider electrodes
		for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			// Load new shift to update the DC tracker
			sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_ACTIVE;
		}

		// All slider electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			// Load DC tracker buffer
			sliderDCTrackerDataBufferRaw[elecNum] = (sliderDCTrackerDataBuffer[elecNum]) << ((sliderDCTrackerDataShift[elecNum]));
		}
}

/*****************************************************************************
 *
 * Function: void SliderDCTrackerShiftDecrease(void)
 *
 * Description: DCtrackershift decrease
 *
 *****************************************************************************/
void SliderDCTrackerShiftDecrease(void)
{
		// All slider electrodes
		for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			// Load new shift to update the DC tracker
			sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_IDLE;
		}

		// All slider electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			// Load DC tracker buffer
			sliderDCTrackerDataBufferRaw[elecNum] = (sliderDCTrackerDataBuffer[elecNum]) << ((sliderDCTrackerDataShift[elecNum]));
		}
}
/*****************************************************************************
 *
 * Function: void SliderElectrodeCapToVoltConvELCH(uint32_t sliderElectrodeNum)
 *
 * Input: Number of the slider electrode
 *
 * Description: Convert slider electrode capacitance to equivalent voltage one by one by CPU
 *
 * Note: This function is not used as the second slider electrode is not acting as guard when scanning the first one
 *
 *****************************************************************************/
void SliderElectrodeCapToVoltConvELCH(uint32_t sliderElectrodeNum)
{
	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif


	// Slider electrode capacitance to voltage conversion
	for (sampleNum = 0; sampleNum < NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider; sampleNum++)
	{
		// Distribute Electrode and Cext charge
		ChargeDistribution(&sliderElecStruct[sliderElectrodeNum]);
		// Delay to distribute charge
		chargeDistributionPeriodTmp = chargeDistributionPeriod;
		while (chargeDistributionPeriodTmp) {chargeDistributionPeriodTmp--;}

		#if (GUARD)
		//Guard pin = 0
		guardStruct[0].gpioBasePtr->PCOR = 1 << guardStruct[0].pinNumberGuard;
		#endif

		// If compiler optimization is not -O3 (is set to none -> -O0), then set TS_ASM_OPTIMIZE macro to 1 in ts_cfg.h
#if(TS_ASM_OPTIMIZE == 1)
        asm volatile (
            /***** ASSEMBLY TEMPLATE ****************************************/
            // Start Cext voltage ADC conversion
            "str %1, [%0, #0]\n\t"    // store %1 to address in %0 with 0 byte offset
            // Redistribute Electrode and Cext charge
            "str %3, [%2, #0]"        // store %3 to address in %2 with 0 byte offset
#if (GUARD)
			// Guard pin = 0
			"\n\tstr %5, [%4, #0]"        // store %5 to address in %4 with 0 byte offset
#endif
            /***** LIST OF OUTPUT OPERANDS **********************************/
            :
            /***** LIST OF INPUT OPERANDS ***********************************/
            :  "r" (&sliderElecStruct[sliderElectrodeNum].adcBasePtr->SC1[0]),  // operand %0
               "r" (sliderElecStruct[sliderElectrodeNum].adcChNum),             // operand %1
               "r" (&sliderElecStruct[sliderElectrodeNum].gpioBasePtr->PDDR),   // operand %2
               "r" ((sliderElecStruct[sliderElectrodeNum].gpioBasePtr->PDDR) & ~(sliderElecStruct[sliderElectrodeNum].portMask))    // operand %3
#if (GUARD)
			   ,"r" (&guardStruct[0].gpioBasePtr->PSOR), // operand %4
			   "r" (guardStruct[0].portMask)  // operand %5
#endif
			   );
#else
		// Start Cext voltage ADC conversion
		sliderElecStruct[sliderElectrodeNum].adcBasePtr->SC1[0] = sliderElecStruct[sliderElectrodeNum].adcChNum;

