sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		// Redistribute Electrode and Cext charge
		ChargeRedistribution(&sliderElecStruct[sliderElectrodeNum]);

#if (GUARD)
		//Guard pin = 1
		guardStruct[0].gpioBasePtr->PSOR = 1 << guardStruct[0].pinNumberGuard;
#endif

#endif

		// Equivalent voltage digitalization
		sliderAdcDataElectrodeDischargeRawSample[sampleNum] = EquivalentVoltageDigitalization(&sliderElecStruct[sliderElectrodeNum]);

		#if JITTERING
			#if (JITTERING_OPTION == 2)
				// Jitter sample rate
				Jitter(sliderAdcDataElectrodeDischargeRaw[sliderElectrodeNum][frequencyID]);
			#endif
		#endif
	}

#if SLIDER_NOISE_CANCELING
	SliderNoiseCanceling();
#endif

	#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
	// Calculate samples sum
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
	}

	if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrodeNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
	}
	else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrodeNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
	}

	#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
	// Calculate samples value average
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
	}
	sliderAdcDataElectrodeDischargeRaw[sliderElectrodeNum][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));
	#else
	#error Please select valid TS method in ts_cfg_general.h
	#endif

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
#endif

	// Set ADCs gain back to calibrated value
	SetADCsGain();
}

/*****************************************************************************
 *
 * Function: void SliderSimultaneousElectrodeCapToVoltConvELCH(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
 *
 * Description: Drive&Convert both slider electrodes capacitance to equivalent voltage simultaneously - with 2 ADC modules at one time (HW trigger) by CPU
 *
 * Note I: Both slider electrode are scanned at once and guard pin can be used as a guard
 *
 * Note II: Both (All) slider electrodes pins must be on the same port, each slider electrode Cext must be on different ADC module
 *
 *****************************************************************************/
void SliderSimultaneousElectrodeCapToVoltConvELCH(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
{
	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif

	// Simultaneous slider electrodes capacitance to voltage conversion
	for (sampleNum = 0; sampleNum < NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider; sampleNum++)
	{
		// Distribute Electrode and Cext charge
		SimultaneousChargeDistribution(&sliderElecStruct[sliderElectrode0Num],&sliderElecStruct[sliderElectrode1Num]);
		// Delay to distribute charge
		chargeDistributionPeriodTmp = chargeDistributionPeriod;
		while (chargeDistributionPeriodTmp) {chargeDistributionPeriodTmp--;}

		#if (GUARD > 0)
		// Guard pin = 0
		guardStruct[0].gpioBasePtr->PCOR = 1 << guardStruct[0].pinNumberGuard;
		#endif

		// Cext voltage conversion - channel PRE-assignment for both slider electrodes
		sliderElecStruct[sliderElectrode0Num].adcBasePtr->SC1[0] = sliderElecStruct[sliderElectrode0Num].adcChNum;
		sliderElecStruct[sliderElectrode1Num].adcBasePtr->SC1[0] = sliderElecStruct[sliderElectrode1Num].adcChNum;

		// If compiler optimization is not -O3 (is set to none -> -O0), then set TS_ASM_OPTIMIZE macro to 1 in ts_cfg.h
#if(TS_ASM_OPTIMIZE == 1)
        asm volatile (
            /***** ASSEMBLY TEMPLATE ****************************************/
            // Start Cext voltage ADC conversion
            "str %1, [%0, #0]\n\t"    // store %1 to address in %0 with 0 byte offset
            // Redistribute Electrode and Cext charge
            "str %3, [%2, #0]"        // store %3 to address in %2 with 0 byte offset
#if (GUARD) // Guard pin = 1
			// Redistribute EGS Electrode and Cext charge
			"\n\tstr %5, [%4, #0]"        // store %5 to address in %4 with 0 byte offset
#endif
            /***** LIST OF OUTPUT OPERANDS **********************************/
            :
            /***** LIST OF INPUT OPERANDS ***********************************/
            :  "r" (&SIM->MISCTRL1),  // operand %0
               "r" (SIM_MISCTRL1_SW_TRG_MASK),             // operand %1
               "r" (&sliderElecStruct[sliderElectrode0Num].gpioBasePtr->PDDR),   // operand %2
               "r" ((sliderElecStruct[sliderElectrode0Num].gpioBasePtr->PDDR) & ~(sliderElecStruct[sliderElectrode0Num].portMask + sliderElecStruct[sliderElectrode1Num].portMask))    // operand %3
#if (GUARD)
			   ,"r" (&guardStruct[0].gpioBasePtr->PSOR), // operand %4
			   "r" (guardStruct[0].portMask)  // operand %5
#endif
        );
#else
		// Generate SW trigger to TRGMUX -> and thus initiate the Cext voltage conversion in both ADC0 and ADC1 at the same time
		// Optimization of code must be set the highest (-O3)
		SIM->MISCTRL1 = SIM_MISCTRL1_SW_TRG_MASK;

