sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		// Redistribute Electrode and Cext charge
		SimultaneousChargeRedistribution(&sliderElecStruct[sliderElectrode0Num],&sliderElecStruct[sliderElectrode1Num]);

#if (GUARD)
		//Guard pin = 1
		guardStruct[0].gpioBasePtr->PSOR = 1 << guardStruct[0].pinNumberGuard;
#endif

#endif
			// Equivalent voltage digitalization for both electrodes of slider at once
			SimultaneousEquivalentVoltageDigitalization(&sliderElecStruct[sliderElectrode0Num],&sliderElecStruct[sliderElectrode1Num]);

			// Store result of the first and second electrode, clear COCO flag
			sliderAdcDataElectrodeDischargeRawSampleElec0[sampleNum] = sliderElecStruct[sliderElectrode0Num].adcBasePtr->R[0];
			sliderAdcDataElectrodeDischargeRawSampleElec1[sampleNum] = sliderElecStruct[sliderElectrode1Num].adcBasePtr->R[0];

		#if JITTERING
			#if (JITTERING_OPTION == 2)
				// Jitter sample rate
				Jitter(sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID]);
			#endif
		#endif
	}

#if SLIDER_NOISE_CANCELING
	SliderNoiseCanceling();
#endif

	#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
	// Calculate samples sum
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec0[sampleNum];
	}

	if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
	}
	else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
	}

	// Calculate samples sum
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec1[sampleNum];
	}

	if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
	}
	else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
	}

	#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
	// Calculate samples value average
	// First electrode
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec0[sampleNum];
	}
	sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));


	// Calculate samples value average
	// Second electrode
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec1[sampleNum];
	}
	sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));
	#else
	#error Please select valid TS method in ts_cfg_general.h
	#endif

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
#endif

	// Set ADCs gain back to calibrated value
	SetADCsGain();
}

/*****************************************************************************
 *
 * Function: void SliderSimultaneousElectrodeCapToVoltConvELCH_DMA(uint32_t electrodeNum)
 *
 * Description: Drive&Convert both slider electrodes capacitance to equivalent voltage simultaneously - with 2 ADC modules at one time (HW trigger) by DMA
 *
 * Note I: Both slider electrode are scanned at once and guard pin can be used as a guard
 *
 * Note II: Both (All) slider electrodes pins must be on the same port, each slider electrode Cext must be on different ADC module
 *
 *****************************************************************************/
void SliderSimultaneousElectrodeCapToVoltConvELCH_DMA(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
{

	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif

	// Start DMA for scanning both slider electrodes simultaneously
	start_TS_SLIDER_Simultaneous_DMA(sliderElectrode0Num, sliderElectrode1Num, (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider));																		// start DMA for slider
	while (!ready_dma_flag);																				// wait for result
	ready_dma_flag = 0;																						// reset flag

#if SLIDER_NOISE_CANCELING
	SliderNoiseCanceling();
#endif

#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
	// Calculate samples sum
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec0[sampleNum];
	}

	if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
	}
	else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
	}

	// Calculate samples sum
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec1[sampleNum];
	}

	if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
	}
	else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
	{
		sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
	}

#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
	// Calculate samples value average
	// First electrode
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec0[sampleNum];
	}
	sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));


	// Calculate samples value average
	// Second electrode
	sliderAdcDataElectrodeDischargeRawCalc = 0;
	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSampleElec1[sampleNum];
	}
	sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));

#else
#error Please select valid TS method in ts_cfg_general.h
#endif

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
#endif

	// Set ADCs gain back to calibrated value
	SetADCsGain();
}
/*****************************************************************************
 *
 * Function: void SliderElectrodeCapToVoltConvELCHGuard(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
 *
 * Description: Drive both slider electrodes simultaneously, but convert slider electrodes one by one - with one ADC module at a time (SW trigger) by CPU
 *
 * Note I: One slider electrode is scanned and the other (together with guard pin, if configured) serves as guard
 *
 * Note II: Both (All) slider electrodes pins must be on the same port, each slider electrode Cext can be on the same or different ADC module
 *
 *****************************************************************************/
void SliderElectrodeCapToVoltConvELCHGuard(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
{
	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif

	// Convert Slider electrode capacitance to equivalent voltage one by one
	for(elecNum = 0 ; elecNum < NUMBER_OF_SLIDER_ELECTRODES ; elecNum++)
	{
		// Slider electrodes capacitance to voltage conversion
		for (sampleNum = 0; sampleNum < NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider; sampleNum++)
		{
			// Distribute Electrode and Cext charge
			SimultaneousChargeDistribution(&sliderElecStruct[sliderElectrode0Num],&sliderElecStruct[sliderElectrode1Num]);
			// Delay to distribute charge
			chargeDistributionPeriodTmp = chargeDistributionPeriod;
			while (chargeDistributionPeriodTmp) {chargeDistributionPeriodTmp--;}

			#if (GUARD)
			// Guard pin = 0
			guardStruct[0].gpioBasePtr->PCOR = 1 << guardStruct[0].pinNumberGuard;
			#endif

			// If compiler optimization is not -O3 (is set to none -> -O0), then set TS_ASM_OPTIMIZE macro to 1 in ts_cfg.h
#if(TS_ASM_OPTIMIZE == 1)
        asm volatile (
            /***** ASSEMBLY TEMPLATE ****************************************/
            // Start Cext voltage ADC conversion
            "str %1, [%0, #0]\n\t"    // store %1 to address in %0 with 0 byte offset
            // Redistribute Electrode and Cext charge
            "str %3, [%2, #0]"        // store %3 to address in %2 with 0 byte offset
#if (GUARD)
			// Guard pin = 0
			"\n\tstr %5, [%4, #0]"        // store %5 to address in %4 with 0 byte offset
#endif
            /***** LIST OF OUTPUT OPERANDS **********************************/
            :
            /***** LIST OF INPUT OPERANDS ***********************************/
            :  "r" (&sliderElecStruct[elecNum].adcBasePtr->SC1[0]),  // operand %0
               "r" (sliderElecStruct[elecNum].adcChNum),             // operand %1
               "r" (&sliderElecStruct[sliderElectrode0Num].gpioBasePtr->PDDR),   // operand %2
               "r" ((sliderElecStruct[sliderElectrode0Num].gpioBasePtr->PDDR) & ~(sliderElecStruct[sliderElectrode0Num].portMask + sliderElecStruct[sliderElectrode1Num].portMask))    // operand %3
#if (GUARD)
			   ,"r" (&guardStruct[0].gpioBasePtr->PSOR), // operand %4
			   "r" (guardStruct[0].portMask)  // operand %5
#endif
        );
#else
        // Start Cext voltage ADC conversion
		sliderElecStruct[elecNum].adcBasePtr->SC1[0] = sliderElecStruct[elecNum].adcChNum;

