sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		// Redistribute Electrode and Cext charge
		SimultaneousChargeRedistribution(&sliderElecStruct[sliderElectrode0Num],&sliderElecStruct[sliderElectrode1Num]);

#if (GUARD)
		// Guard pin = 1
		guardStruct[0].gpioBasePtr->PSOR = 1 << guardStruct[0].pinNumberGuard;
#endif

#endif
			// Equivalent voltage digitalization
			sliderAdcDataElectrodeDischargeRawSample[sampleNum] = EquivalentVoltageDigitalization(&sliderElecStruct[elecNum]);

			#if JITTERING
				#if (JITTERING_OPTION == 2)
					Jitter(sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID]);
				#endif
			#endif
		}

#if SLIDER_NOISE_CANCELING
		SliderNoiseCanceling();
#endif

		#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
		// Calculate samples sum
		sliderAdcDataElectrodeDischargeRawCalc = 0;
		for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
		{
			sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
		}

		if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
		{
			sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
		}
		else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
		{
			sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
		}

		#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
		// Calculate samples value average
		sliderAdcDataElectrodeDischargeRawCalc = 0;
		for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
		{
			sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
		}
		sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));
		#else
		#error Please select valid TS method in ts_cfg_general.h
		#endif

	}
	#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
	#endif
	// Set ADCs gain back to calibrated value
	SetADCsGain();
}

/*****************************************************************************
 *
 * Function: void SliderElectrodeCapToVoltConvELCH_DMA(uint32_t electrodeNum)
 *
 * Description: Drive both slider electrodes simultaneously, but convert slider electrodes one by one - with one ADC module at a time (SW trigger) by DMA
 *
 * Note I: One slider electrode is scanned and the other (together with guard pin, if configured) serves as guard (configured in tcd)
 *
 * Note II: Both (All) slider electrodes pins must be on the same port, each slider electrode Cext can be on the same or different ADC module
 *
 *****************************************************************************/
void SliderElectrodeCapToVoltConvELCH_DMA(uint32_t electrodeNum)
{
	// Clear ADCs gain (lower noise)
	ClearADCsGain();

#ifdef DEBUG_ELECTRODE_SENSE
	// Pin clear
	R_RMW32(&(DES_GPIO->PCOR), DES_PIN, 1);
#endif

	// Start DMA for scanning slider electrodes
	start_TS_SLIDER_DMA(electrodeNum, (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider));																		// start DMA for slider
	while (!ready_dma_flag);																				// wait for result
	ready_dma_flag = 0;																						// reset flag

#if SLIDER_NOISE_CANCELING
		SliderNoiseCanceling();
#endif

		#if(TS_RAW_DATA_CALCULATION == OVERSAMPLING)
		// Calculate samples sum
		sliderAdcDataElectrodeDischargeRawCalc = 0;
		for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
		{
			sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
		}

		if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE)
		{
			sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);
		}
		else if (numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
		{
			sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] = (sliderAdcDataElectrodeDischargeRawCalc >> OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE);
		}

		#elif(TS_RAW_DATA_CALCULATION == AVERAGING)
		// Calculate samples value average
		sliderAdcDataElectrodeDischargeRawCalc = 0;
		for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
		{
			sliderAdcDataElectrodeDischargeRawCalc = sliderAdcDataElectrodeDischargeRawCalc + sliderAdcDataElectrodeDischargeRawSample[sampleNum];
		}
		sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] = (int32_t)(sliderAdcDataElectrodeDischargeRawCalc / (numberOfElectrodeSensingCyclesPerSampleSlider-sliderDroppedSamples));
		#else
		#error Please select valid TS method in ts_cfg_general.h
		#endif

	#ifdef DEBUG_ELECTRODE_SENSE
	// Pin set
	R_RMW32(&(DES_GPIO->PSOR), DES_PIN, 1);
	#endif
	// Set ADCs gain back to calibrated value
	SetADCsGain();
}
/*****************************************************************************
*
* Function: void SliderElectrodeTouchDetect(uint32_t electrodeNum)
*
* Description: Detect electrode touch
*
*****************************************************************************/
void SliderElectrodeTouchDetect(uint32_t electrodeNum)
{
	// Slider electrode touched ? z-axis touch detection
	if (sliderLPFilterData[electrodeNum][frequencyID] < sliderDetectorThresholdTouch[electrodeNum])

	{
		// y-axis touch confirmation
		if (sliderAdditionData < sliderAdditionDataThreshold)
		{
			// Report touch detected and confirmed
			sliderElectrodeTouch[electrodeNum][frequencyID] = 2;

			#ifdef WAKE_UP_ELECTRODE
			// Load counter to do not return to the wake-up function
			// Do not return to the wake-up function, when electrode released and electrode signal value is above touch and bellow release threshold
			// Expected SR <= 1s
			electrodeWakeUpActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;
			#else
			// Load counter to prevent switching of number of samples per cycle to idle
			sliderVirtualEGSActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;
			#endif

