sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		}
		else
		{
			// Report touch detected, but not confirmed
			sliderElectrodeTouch[electrodeNum][frequencyID] = 1;
		}
	}
	// Electrode released?
	else
	{
		// Report released
		sliderElectrodeTouch[electrodeNum][frequencyID] = 0;
	}

	// Fast release detection
	// Previously touched slider Electrode FAST RELEASED? z-axis touch detection
	if (sliderElectrodeTouch[electrodeNum][frequencyID] > 1)
	{
		// Slider electrode raw data risen above touch threshold?
		if (sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] > sliderDetectorThresholdTouch[electrodeNum])
		{
			// Report released
			sliderElectrodeTouch[electrodeNum][frequencyID] = 0;
		}
	}
}
/*****************************************************************************
 *
 * Function: void SliderElectrodeTouchElecSense(void)
 *
 * Description: Sense slider electrodes
 *
 *****************************************************************************/
void SliderElectrodesTouchElecSense(void)
{
	// Disable interrupts
	//DisableInterrupts;

#ifndef WAKE_UP_ELECTRODE
#ifdef DEBUG_ALGORITHM
	// Pin clear
	R_RMW32(&(DA_GPIO->PCOR), DA_PIN, 1);
#endif
#endif

	// Configure all slider electrodes floating
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		ElectrodeFloat(&sliderElecStruct[elecNum]);
	}

	// Configure all touch button (and EGS) electrodes floating
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
	    ElectrodeFloat(&elecStruct[elecNum]);
	}

#if (NUMBER_OF_USED_ADC_MODULES == 2)
	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)

		// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once	by DMA
		SliderSimultaneousElectrodeCapToVoltConvELCH_DMA(SLIDER_ELEC0,SLIDER_ELEC1);

	#else
		// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once by CPU
		SliderSimultaneousElectrodeCapToVoltConvELCH(SLIDER_ELEC0, SLIDER_ELEC1);
	#endif
#else

	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)
	for (elecNum = 0; elecNum < (NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		// Convert Slider electrode capacitance to equivalent voltage one by one using DMA (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCH_DMA(elecNum);
	}
	#else
		// Convert Slider electrode capacitance to equivalent voltage one by one using CPU (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCHGuard(SLIDER_ELEC0, SLIDER_ELEC1);
	#endif
#endif

	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC Tracker, if both slider electrodes not touched
		if (sliderElectrodeTouch[SLIDER_ELEC0][frequencyID] < 1 && sliderElectrodeTouch[SLIDER_ELEC1][frequencyID] < 1)
		{
			// Update DC Tracker
			sliderDCTrackerDataBuffer[elecNum] = DCTracker(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderDCTrackerDataBufferRaw[elecNum]), sliderDCTrackerDataShift[elecNum]);
		}

#if DECIMATION_FILTER
		// Decimation filtering
		SliderDecimationFilter(elecNum);
#endif
		// Calculate the relative touch threshold of the slider electrode
		sliderDetectorThresholdTouch[elecNum] = sliderDCTrackerDataBuffer[elecNum] - sliderDetectorThresholdTouchDelta[elecNum];
	}

	// All slider electrodes
	for(elecNum = NUMBER_OF_ELECTRODES; elecNum < (NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
#if DECIMATION_FILTER
		// Filter Slider electrode DF signal using IIR LP filter
		sliderLPFilterData[(elecNum) - NUMBER_OF_ELECTRODES][frequencyID] = FilterIIR1(elecNum, (tFrac32)(sliderAdcDataElectrodeDischargeRawDF[(elecNum) - NUMBER_OF_ELECTRODES][frequencyID]), frequencyID);
#else
		// Filter Slider electrode raw signal using IIR LP filter
		sliderLPFilterData[(elecNum) - NUMBER_OF_ELECTRODES][frequencyID] = FilterIIR1(elecNum, (tFrac32)(sliderAdcDataElectrodeDischargeRaw[(elecNum) - NUMBER_OF_ELECTRODES][frequencyID]), frequencyID);
#endif
	}

	// Calculate slider addition and difference data
	SliderDataCalculation(SLIDER_ELEC0, SLIDER_ELEC1);

	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Slider electrode touched?
		SliderElectrodeTouchDetect(elecNum);
	}

	// Qualify the slider touch event - x-axis touch qualification
	SliderDifferenceDataElectrodeTouchQualify(SLIDER_ELEC0, SLIDER_ELEC1);

	// Drive all Slider electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&sliderElecStruct[elecNum]);
	}

	// Drive all touch button (and EGS) electrodes to GND
	for (elecNum = 0; elecNum < NUMBER_OF_ELECTRODES; elecNum++)
	{
		ElectrodeGnd(&elecStruct[elecNum]);
	}
#ifndef WAKE_UP_ELECTRODE
#ifdef DEBUG_ALGORITHM
	// Pin set
	R_RMW32(&(DA_GPIO->PSOR), DA_PIN, 1);
#endif
#endif

	// Enable interrupts
	//EnableInterrupts;
}

/*****************************************************************************
 *
 * Function: void SliderDataCalculation(uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
 *
 * Input: Numbers of the slider electrodes pair (e.g. 0, 1)
 *
 * Description: Calculate slider differential and addition data (el0-el1 etc.)
 *
 *****************************************************************************/
void SliderDataCalculation(uint32_t sliderElectrode0Num, uint32_t sliderElectrode1Num)
{
	// Difference data
	// Subtract the raw data from each other, normalize them with respect to their different baselines, and add SLIDER_DIFFADD_DATA_OFFSET (new baseline)
	// el0-el1
	sliderDifferenceData = (sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] - sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID]) - (sliderDCTrackerDataBuffer[sliderElectrode0Num] - sliderDCTrackerDataBuffer[sliderElectrode1Num]);
	sliderDifferenceData += SLIDER_DIFFADD_DATA_OFFSET;

	// Difference data filtered
	// Subtract the filtered data from each other, normalize them with respect to their different baselines, and add SLIDER_DIFFADD_DATA_OFFSET (new baseline)
	// el0-el1
	sliderDifferenceDataFiltered = (sliderLPFilterData[sliderElectrode0Num][frequencyID] - sliderLPFilterData[sliderElectrode1Num][frequencyID]) - (sliderDCTrackerDataBuffer[sliderElectrode0Num] - sliderDCTrackerDataBuffer[sliderElectrode1Num]);
	sliderDifferenceDataFiltered += SLIDER_DIFFADD_DATA_OFFSET;

