sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
	// Addition data
	// Add the raw data of both electrodes, normalize them with respect to their different baselines, and add SLIDER_DIFFADD_DATA_OFFSET (new baseline)
	// el0+el1
	sliderAdditionData = (sliderAdcDataElectrodeDischargeRaw[sliderElectrode0Num][frequencyID] + sliderAdcDataElectrodeDischargeRaw[sliderElectrode1Num][frequencyID]) - (sliderDCTrackerDataBuffer[sliderElectrode0Num] + sliderDCTrackerDataBuffer[sliderElectrode1Num]);
	sliderAdditionData += SLIDER_DIFFADD_DATA_OFFSET;

	// Calculate slider absolute raw and filtered data value, slider resolution: approx. range 0-49 (50 values)
	sliderAbsoluteRawData = (sliderDifferenceData - NUMBER_OF_MINIMAL_OBSERVED_DIFFERENCE);
	sliderAbsoluteRawDataFiltered = (sliderDifferenceDataFiltered - NUMBER_OF_MINIMAL_OBSERVED_DIFFERENCE);

}

/*****************************************************************************
 *
 * Function: void SliderDifferenceDataElectrodeTouchQualify (uint32_t sliderElectrode0Num,uint32_t sliderElectrode1Num)
 *
 * Input: Numbers of the slider electrodes pair (e.g. 0, 1)
 *
 * Description: Qualification of the slider touch event when using the differential data = ((el0-el1)-(el1-el0))
 *
 *****************************************************************************/
void SliderDifferenceDataElectrodeTouchQualify (uint32_t sliderElectrode0Num, uint32_t sliderElectrode1Num)
{

#if FREQUENCY_HOPPING
	// At least one of the slider electrodes reported as touched AND the number of samples per cycle has been risen (from previous mcu duty cycle)
	if (((sliderElectrodeTouch[sliderElectrode0Num][0] > 1 && sliderElectrodeTouch[sliderElectrode0Num][1] > 1) || (sliderElectrodeTouch[sliderElectrode1Num][0] > 1 && sliderElectrodeTouch[sliderElectrode1Num][1] > 1)) &&
			numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE && frequencyID == 1)
#else
		// At least one of the slider electrodes reported as touched AND the number of samples per cycle has been risen (from previous mcu duty cycle)
	if ((sliderElectrodeTouch[sliderElectrode0Num][frequencyID] > 1 || sliderElectrodeTouch[sliderElectrode1Num][frequencyID] > 1) &&
			numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
#endif
	{

		// Report slider electrode touch for flextimer for background lightning, prevent entry to VLPS
		sliderElectrodeTouchQualifiedReport = 1;
		// Reset  positionCounter of the slider RGB lights
		positionCounter = 1;
		// Set hysteresis detection to false
		hitHysteresis = FALSE;
		// Set decided position to false
		positionDeciced = FALSE;

		// Decide the position of finger based on thresholds in cfg

		// At least one threshold defined in cfg?
#if (NUMBER_OF_SLIDER_THRESHOLDS > 0)

		// Are the data below the first threshold - threshold[0]?
		if (sliderDifferenceData < sliderDiffThreshold[0])
		{
			// Check if the data had hit the hysteresis interval below the first threshold
			if (sliderDifferenceData > (sliderDiffThreshold[0] - numberOfHysteresisBlindPoints))
			{
				// Is this a first touch of the slider? -> qualify the position anyway
				if(firstSliderTouch == TRUE)
				{
					sliderElectrodeTouchQualified = positionCounter;
					positionDeciced = TRUE;
					firstSliderTouch = FALSE;
				}

				else
					// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
					hitHysteresis = TRUE;
			}

			// Else qualify the position on slider
			else
			{
				sliderElectrodeTouchQualified = positionCounter;
				positionDeciced = TRUE;
				firstSliderTouch = FALSE;
			}
		}

#if (NUMBER_OF_SLIDER_THRESHOLDS > 1)// More than one threshold defined in cfg?

		// Are the data somewhere between the threshold[0] and the last threshold then?
		else if((sliderDifferenceData >= sliderDiffThreshold[0]) &&
				(sliderDifferenceData < *sliderLastDiffThreshold))
		{

			// For cycle to determine the position across the thresholds - between the threshold[0] and the last threshold
			for(thresholdNum = 0; thresholdNum<NUMBER_OF_SLIDER_THRESHOLDS; thresholdNum++)
			{
				// Increase the  positionCounter of the RGB lights by one
				positionCounter++;

				if (sliderDifferenceData >= sliderDiffThreshold[thresholdNum] &&
						sliderDifferenceData < sliderDiffThreshold[thresholdNum+1])
				{
					// Now check if the data had hit the top or bottom hysteresis interval within the e.g first and e.g second threshold (under first and above second threshold)
					if (sliderDifferenceData > (sliderDiffThreshold[thresholdNum] + numberOfHysteresisBlindPoints) &&
							sliderDifferenceData < (sliderDiffThreshold[thresholdNum+1] - numberOfHysteresisBlindPoints))
					{
						// The data are in the active area = between the hysteresis intervals - thus qualify the position on slider
						sliderElectrodeTouchQualified = positionCounter;
						positionDeciced = TRUE;
						firstSliderTouch = FALSE;
					}

					else
					{
						// Is this a first touch of the slider? -> qualify the position anyway
						if(firstSliderTouch == TRUE)
						{
							sliderElectrodeTouchQualified = positionCounter;
							positionDeciced = TRUE;
							firstSliderTouch = FALSE;
						}

						else
							// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
							hitHysteresis = TRUE;
					}

					// Exit for cycle
					break;
				}
			}
		}

#endif
		// The data did not fit between any thresholds - are the data above the last threshold?
		else
		{
			// Check if the data were previously marked as within hysteresis interval
			if(hitHysteresis == TRUE || positionDeciced == TRUE)
			{
				// Do not change the sliderElectrodeTouchQualified
			}

			// Check for hysteresis above the last threshold (similar principle as checking for hysteresis below the first threshold)
			else
			{
				if(sliderDifferenceData >= *sliderLastDiffThreshold &&
						sliderDifferenceData < (*sliderLastDiffThreshold + numberOfHysteresisBlindPoints))
				{
					// Is this a first touch of the slider? -> qualify the position anyway as the highest
					if(firstSliderTouch == TRUE)
					{
						sliderElectrodeTouchQualified = NUMBER_OF_SLIDER_SEGMENTS;
						positionDeciced = TRUE;
						firstSliderTouch = FALSE;
					}

					else
						// It hit the blind hysteresis interval and the first touch has already been done - set hitHysteresis True
						hitHysteresis = TRUE;

