sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
				}

				// The data were not within the hysteresis interval
				else
				{
					// Qualify the position on slider as the highest
					sliderElectrodeTouchQualified = NUMBER_OF_SLIDER_SEGMENTS;
					positionDeciced = TRUE;
					firstSliderTouch = FALSE;
				}
			}
		}
#endif

	}

	// Else no touch?
	else
	{
#if FREQUENCY_HOPPING
		if (frequencyID == 1)
#endif
		{
			// Report slider electrode release for flextimer for background lightning and for jumping to VLPS
			sliderElectrodeTouchQualifiedReport = 0;

			// Report no slider qualified touch
			sliderElectrodeTouchQualified = 0;

			// Reset the firstSliderTouch variable
			firstSliderTouch = TRUE;
		}
	}
}

/*****************************************************************************
 *
 * Function: void SliderelectrodeWakeElecSense(void)
 *
 * Description: Sense slider electrodes to keep track of the electrodes baselines while scanning the wake up electrode
 *
 *****************************************************************************/

void SliderelectrodeWakeElecSense(void)
{
#if (NUMBER_OF_USED_ADC_MODULES == 2)
	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)
	// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once by DMA
	SliderSimultaneousElectrodeCapToVoltConvELCH_DMA(SLIDER_ELEC0,SLIDER_ELEC1);
	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC Tracker of both slider electrodes
		sliderDCTrackerDataBuffer[elecNum] = DCTracker(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderDCTrackerDataBufferRaw[elecNum]), sliderDCTrackerDataShift[elecNum]);
	}
	#else
		// Convert slider electrodes capacitance to equivalent voltage simultaneously - at once by CPU
		SliderSimultaneousElectrodeCapToVoltConvELCH(SLIDER_ELEC0, SLIDER_ELEC1);
		// All slider electrodes
		for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
		{
			// Update DC Tracker of both slider electrodes
			sliderDCTrackerDataBuffer[elecNum] = DCTracker(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderDCTrackerDataBufferRaw[elecNum]), sliderDCTrackerDataShift[elecNum]);
		}
	#endif
#else
	#if (TS_ELECTRODE_DATA_ACQUISITION == DMA_ELECTRODE_DATA_ACQUISITION)
	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Convert Slider electrode capacitance to equivalent voltage one by one by DMA (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCH_DMA(elecNum);
		// Update DC Tracker of both slider electrodes
		sliderDCTrackerDataBuffer[elecNum] = DCTracker(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderDCTrackerDataBufferRaw[elecNum]), sliderDCTrackerDataShift[elecNum]);
	}
	#else
		// Convert Slider electrode capacitance to equivalent voltage one by one by CPU (the other slider electrode serves as a guard)
		SliderElectrodeCapToVoltConvELCHGuard(SLIDER_ELEC0, SLIDER_ELEC1);
	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC Tracker of both slider electrodes
		sliderDCTrackerDataBuffer[elecNum] = DCTracker(sliderAdcDataElectrodeDischargeRaw[elecNum][frequencyID], &(sliderDCTrackerDataBufferRaw[elecNum]), sliderDCTrackerDataShift[elecNum]);
	}
	#endif
#endif

}

/*****************************************************************************
 *
 * Function: void SliderElectrodeWakeElecFilterLoad(void)
 *
 * Description: Update slider electrodes filter in case wake-up (EGS) electrode was touched
 *
 *****************************************************************************/
void SliderElectrodeWakeElecFilterLoad(void)
{
	// All slider electrodes
	for (elecNum = NUMBER_OF_ELECTRODES; elecNum < (NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
	{
		// Touch not detected nor confirmed on both slider electrodes?
		if (sliderElectrodeTouch[SLIDER_ELEC0][frequencyID] < 1 && sliderElectrodeTouch[SLIDER_ELEC1][frequencyID] < 1)
		{
		// Load IIR1 LP Filter buffer (X, Y) with (sliderDCTracker - threshold / 2)
		FilterIIR1BufferInit(elecNum, ((tFrac32)(sliderDCTrackerDataBuffer[(elecNum) - NUMBER_OF_ELECTRODES] - (sliderDetectorThresholdTouchDelta[(elecNum) - NUMBER_OF_ELECTRODES] / 2))), \
				((tFrac32)((sliderDCTrackerDataBuffer[(elecNum) - NUMBER_OF_ELECTRODES]- (sliderDetectorThresholdTouchDelta[(elecNum) - NUMBER_OF_ELECTRODES] / 2)))), frequencyID);

		}
	}

}
#if SLIDER_NOISE_CANCELING
/*****************************************************************************
 *
 * Function: void SliderNoiseCanceling(void)
 *
 * Description: Slider noise canceling function
 *
 *****************************************************************************/
void SliderNoiseCanceling(void)
{
	switch(NUMBER_OF_USED_ADC_MODULES)
	{
	case 2:
	{
		// Find minimal sample values for each electrode and cancel it
		if(numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
		{

			for(sampleNum=0; sampleNum < 1; sampleNum++)
			{
				FindMinimumAndDeleteIt(sliderAdcDataElectrodeDischargeRawSampleElec0);
				FindMinimumAndDeleteIt(sliderAdcDataElectrodeDischargeRawSampleElec1);
			}
			sliderDroppedSamples = 1;
		}
		else

			sliderDroppedSamples = 0;
	}
	break;

	case 1:
	{
		// Find minimal sample values for each electrode and cancel it
		if(numberOfElectrodeSensingCyclesPerSampleSlider == NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE)
		{

			for(sampleNum=0; sampleNum<1; sampleNum++)
			{
				FindMinimumAndDeleteIt(sliderAdcDataElectrodeDischargeRawSample);
			}
			sliderDroppedSamples = 1;
		}
		else

			sliderDroppedSamples = 0;

	}
	break;
	}

}
/*****************************************************************************
 *
 * Function: void FindMinimumAndDeleteIt(int16_t sliderInputSamplesArray[])
 *
 * Input: Array of ADC cycles (scans) for one averaged sample
 *
 * Description: Finds minimum element in an array and deletes it, can be used multiple times
 *
 *****************************************************************************/
void FindMinimumAndDeleteIt(int16_t sliderInputSamplesArray[])
{

	int16_t min, index, i, sampleNum;
	i = 0;

	do
	{
		min = sliderInputSamplesArray[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE+i];//set the minimum on [1] place in the array
		index = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE+i;
		i++;
	}while(min == 0);// While the minimum is zero, try  next element

	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < (NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider); sampleNum++)
	{
		//if the array element is smaller than the set minimum and is not 0
		if (sliderInputSamplesArray[sampleNum] < min && sliderInputSamplesArray[sampleNum] > 0)
		{
			index = sampleNum;
			min = sliderInputSamplesArray[sampleNum];
		}
	}

	sliderInputSamplesArray[index] = 0;// Delete that minimum element
}

/*****************************************************************************
 *
 * Function: void FindMaximumAndDeleteIt(int16_t sliderInputSamplesArray[])
 *
 * Input: Array of ADC cycles (scans) for one averaged sample
 *
 * Description: Finds maximum element in an array and deletes it, can be used multiple times
 *
 *****************************************************************************/
void FindMaximumAndDeleteIt(int16_t sliderInputSamplesArray[])
{

	int16_t max, index, sampleNum;

	max = sliderInputSamplesArray[NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE];
	index = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE;

	for (sampleNum = NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE; sampleNum < NUMBER_OF_ELECTRODE_SENSING_PRECYCLES_PER_SAMPLE + numberOfElectrodeSensingCyclesPerSampleSlider; sampleNum++)
	{
		if (sliderInputSamplesArray[sampleNum] > max)
		{
			index = sampleNum;
			max = sliderInputSamplesArray[sampleNum];
		}
	}

	sliderInputSamplesArray[index] = 0;
}
#endif

#ifdef WAKE_UP_ELECTRODE
/*****************************************************************************
 *
 * Function: void SliderSensingCyclesChangeEGS(void)
 *
 * Description: Changes the number of sensing cycles for slider electrodes per sample based on whether the proximity EGS was touched
 *
 *****************************************************************************/
void SliderSensingCyclesChangeEGS(void)
{
	if(electrodeTouch[WAKE_UP_ELECTRODE][0] == 1)
	{
		// Change the number of slider sensing cycles per sample to active
		numberOfElectrodeSensingCyclesPerSampleSlider = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE;
	}
	else
	{
		// Change the number of slider sensing cycles per sample to idle
		numberOfElectrodeSensingCyclesPerSampleSlider = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE;
	}
}
#else
/*****************************************************************************
 *
 * Function: void SliderSensingCyclesChange(void)
 *
 * Description: Changes the number of sensing cycles per sample for slider electrodes
 *
 *****************************************************************************/
void SliderSensingCyclesChange(void)
{
	uint8_t electrodeNum;

	// Detect if any of the slider electrodes was reported as proximately touched
	for(electrodeNum = 0; electrodeNum < NUMBER_OF_SLIDER_ELECTRODES; electrodeNum++)
	{
#if FREQUENCY_HOPPING
		// If on both frequencies proximity detected
		if((sliderLPFilterData[electrodeNum][0] < (sliderDCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)) &&  \
				(sliderLPFilterData[electrodeNum][1] < (sliderDCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA)))
#else
			// If proximity detected
			if(sliderLPFilterData[electrodeNum][frequencyID] < (sliderDCTrackerDataBuffer[electrodeNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA))
#endif
			{
				// Report wake up
				sliderVirtualEGSActivateCounter = ELEC_WAKEUP_ACTIVATE_COUNTER;

				// If this is first touch
				if (sliderVirtualEGSTouch != 1)
				{
					// Report that slider electrodes proximately touched
					sliderVirtualEGSTouch = 1;

