sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
					// Activate the oversampling just once after first confirmed proximity
					if (sliderOversamplingActivationReport != 1)
					{
						// Activate slider electrodes DC tracker adjustments for oversampling - to active mode
						SliderElecOversamplingActivation();

						// Report slider Oversampling activation done
						sliderOversamplingActivationReport = 1;

						// Save frequencyID
						frequencyIDsave = frequencyID;

						// All (both) used scanning frequencies
						for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
						{
							// All slider electrodes
							for(elecNum = NUMBER_OF_ELECTRODES; elecNum < (NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
							{
								// Load IIR1 LP Filter buffer (X, Y) exactly with corresponding value
								FilterIIR1BufferInit(elecNum, ((tFrac32)(sliderDCTrackerDataBuffer[elecNum - NUMBER_OF_ELECTRODES] - (VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA << (OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE - OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE)))), \
										((tFrac32)(sliderDCTrackerDataBuffer[elecNum - NUMBER_OF_ELECTRODES] - (VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA << (OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE - OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE)))), frequencyID);
							}
						}
						// Set back original frequencyID
						frequencyID = frequencyIDsave;

#if DECIMATION_FILTER
						// Save frequencyID
						frequencyIDsave = frequencyID;

						// All (both) used scanning frequencies
						for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
						{
							// All slider electrodes
							for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
							{
								// Load DF array exactly with corresponding value
								sliderAdcDataElectrodeDischargeRawDF[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum] - VIRTUAL_EGS_TOUCH_THRESHOLD_DELTA;
							}
						}
						// Set back original frequencyID
						frequencyID = frequencyIDsave;
#endif

					}
#endif
					// Change the number of slider sensing cycles per sample to active
					numberOfElectrodeSensingCyclesPerSampleSlider = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_ACTIVE;

				}
				// Exit the for loop
				break;
			}

			else
			{
				// Came to the last slider electrode (did not manage to escape the loop so far)
				if(electrodeNum == (NUMBER_OF_SLIDER_ELECTRODES - 1))
				{
					// Wake up counter
					if(sliderVirtualEGSActivateCounter == 0)
					{
						// Report that slider electrodes proximity released
						sliderVirtualEGSTouch = 0;

#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
						if (sliderOversamplingActivationReport == 1)
						{
							// Deactivate slider electrodes DC tracker adjustments for oversampling - back to idle mode
							SliderElecOversamplingDeactivation();

							// Save frequencyID
							frequencyIDsave = frequencyID;

							// Load DF array with new DC tracker value
							for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
							{
								// All slider electrodes
								for(elecNum = NUMBER_OF_ELECTRODES; elecNum < (NUMBER_OF_ELECTRODES + NUMBER_OF_SLIDER_ELECTRODES); elecNum++)
								{
									// Load IIR1 LP Filter buffer (X, Y) with DC tracker value
									FilterIIR1BufferInit(elecNum, ((tFrac32)(sliderDCTrackerDataBuffer[elecNum - NUMBER_OF_ELECTRODES])), \
											((tFrac32)(sliderDCTrackerDataBuffer[elecNum - NUMBER_OF_ELECTRODES])), frequencyID);
								}
							}
							// Set back original frequencyID
							frequencyID = frequencyIDsave;

							// Report electrodes Oversampling de-activation done
							sliderOversamplingActivationReport = 0;

#if DECIMATION_FILTER
							// Save frequencyID
							frequencyIDsave = frequencyID;

							// All (both) used scanning frequencies
							for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
							{
								// All slider electrodes
								for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
								{
									// Load DF array with new DC tracker value
									sliderAdcDataElectrodeDischargeRawDF[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum];
								}
							}
							// Set back original frequencyID
							frequencyID = frequencyIDsave;
#endif
						}
#endif
						// Change the number of slider sensing cycles per sample to idle
						numberOfElectrodeSensingCyclesPerSampleSlider = NUMBER_OF_ELECTRODE_SENSING_CYCLES_PER_SAMPLE_SLIDER_IDLE;

					}
					else
					{
						// Decrement wake up activate counter
						if(sliderVirtualEGSActivateCounter != 0)
						{
							sliderVirtualEGSActivateCounter--;
						}
					}
				}
			}
	}
}
#endif

#if (TS_RAW_DATA_CALCULATION == OVERSAMPLING)
/*****************************************************************************
 *
 * Function: void SliderElecOversamplingActivation(void)
 *
 * Description: Activate slider electrodes DC tracker adjustments for oversampling - to active mode
 *
 *****************************************************************************/
void SliderElecOversamplingActivation(void)
{
	// All slider electrodes
	for(elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Load new shift to update the DC tracker
		sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_ACTIVE;

		// Set DCTracker value to correspond to number of samples taken in Active state
		sliderDCTrackerDataBuffer[elecNum] = sliderDCTrackerDataBuffer[elecNum] << (OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE - OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);

		// Load DC tracker buffer
		sliderDCTrackerDataBufferRaw[elecNum] = (sliderDCTrackerDataBuffer[elecNum]) << ((sliderDCTrackerDataShift[elecNum]));

		// Slider electrode threshold recalculation
		sliderDetectorThresholdTouch[elecNum] = sliderDCTrackerDataBuffer[elecNum] - sliderDetectorThresholdTouchDelta[elecNum];
	}

		#if DECIMATION_FILTER
		   // Save frequencyID
		   frequencyIDsave = frequencyID;

		   // All (both) used scanning frequencies
			for (frequencyID = 0; frequencyID < NUMBER_OF_HOPPING_FREQUENCIES; frequencyID++)
			{
				// All slider electrodes
				for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
				{
					// Load DF array with DC tracker value  - used when oversampling with EGS
					sliderAdcDataElectrodeDischargeRawDF[elecNum][frequencyID] = sliderDCTrackerDataBuffer[elecNum];
				}
			}
			// Set back original frequencyID
			frequencyID = frequencyIDsave;
		#endif
}

/*****************************************************************************
 *
 * Function: void SliderElecOversamplingDeactivation(void)
 *
 * Description: Deactivate slider electrodes DC tracker adjustments for oversampling - back to idle mode
 *
 *****************************************************************************/
void SliderElecOversamplingDeactivation(void)
{
	// All slider electrodes
	for (elecNum = 0; elecNum < NUMBER_OF_SLIDER_ELECTRODES; elecNum++)
	{
		// Update DC tracker shift
		sliderDCTrackerDataShift[elecNum] = SLIDER_ELEC_DCTRACKER_FILTER_FACTOR_IDLE;

		// Set DCTracker value to correspond to number of samples taken in Active state
		sliderDCTrackerDataBuffer[elecNum] = sliderDCTrackerDataBuffer[elecNum] >> (OVERSAMPLING_VALUE_SHIFT_SLIDER_ACTIVE - OVERSAMPLING_VALUE_SHIFT_SLIDER_IDLE);

