sicreative/NXPISELEDDemo/iseled_freemaster_s32k144/Sources/TS/slider.c
		// Load DC tracker buffer
		sliderDCTrackerDataBufferRaw[elecNum] = (sliderDCTrackerDataBuffer[elecNum]) << ((sliderDCTrackerDataShift[elecNum]));

		// Slider electrode threshold recalculation
		sliderDetectorThresholdTouch[elecNum] = sliderDCTrackerDataBuffer[elecNum] - sliderDetectorThresholdTouchDelta[elecNum];
	}

}
#endif

#if DECIMATION_FILTER
/*****************************************************************************
 *
 * Function: void SliderDecimationFilter(uint32_t electrodeNum)
 *
 * Description: Incerement or decrement decimation filter value
 *
 *****************************************************************************/
void SliderDecimationFilter(uint32_t electrodeNum)
{
		// Is the electrode raw data value still smaller than electrode decimation filter value?
		if(sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] < sliderAdcDataElectrodeDischargeRawDF[electrodeNum][frequencyID])
		{
			// Decrement DF value - follow the raw data down
			sliderAdcDataElectrodeDischargeRawDF[electrodeNum][frequencyID] -= DECIMATION_STEP ;
		}
		// Is the electrode raw data value same as electrode decimation filter value?
		else if ((sliderAdcDataElectrodeDischargeRaw[electrodeNum][frequencyID] == sliderAdcDataElectrodeDischargeRawDF[electrodeNum][frequencyID]))
		{
			// Do nothing
		}

		else
		{
			// Increment DF value - follow  the raw data back up to the baseline
			sliderAdcDataElectrodeDischargeRawDF[electrodeNum][frequencyID] += DECIMATION_STEP;
		}
}

#endif

// Slider enable
#endif
